ajaygnsharma/apps/HTML/EITEclipse/08_EIT/app/src/uTasker_LPC23XX.c
 /************************************************
   Mark Butcher              Bsc (Hons) MPhil MIET
   Mark@uTasker.com                www.uTasker.com

   Copyright (C) M.J.Butcher Consulting 2004..2008
   Licensed to Newport Electronics, INC
   ***********************************************
   uTasker_LPC23XX.c
   4.9.2008

   This file contains extracts from the uTasker
   LPC23XX HW interface, as required to support
   the uFileSystem used to enable software uploads

   */

#define _LPC23XX
#ifdef _LPC23XX

/* =================================================================== */
/*                           include files                             */
/* =================================================================== */

#define OPSYS_CONFIG                                                     // this module owns the operating system configuration
#define INITHW  static
#define _SIM_PORT_CHANGE
#include "uTasker.h"
#include <string.h>


/* =================================================================== */
/*                          local definitions                          */
/* =================================================================== */

#ifdef COMPILE_IAR
    #define __interrupt   __irq __arm
    #ifdef _LPC21XX
        #define acknowledge_irq()   VICVectAddr = 0;
    #else
        #define acknowledge_irq()   VICAddress = 0;                      // IAR enables direct calls to interrupt routine
    #endif
#else
    #define __interrupt__
    #define __interrupt
    #define __root
    #define acknowledge_irq()                                            // GNU has a problem doing this so uses a dispatcher in assember which handles the acknowledge
#endif


/* =================================================================== */
/*                       local structure definitions                   */
/* =================================================================== */


/* =================================================================== */
/*                global function prototype declarations               */
/* =================================================================== */


/* =================================================================== */
/*                 local function prototype declarations               */
/* =================================================================== */

#if !defined SPI_INTERFACE && (defined SPI_FILE_SYSTEM || defined SPI_SW_UPLOAD)
    static void fnConfigSPIFileSystem(unsigned char ucSpeed); 
    #if defined SPI_SW_UPLOAD || (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM)
        #if !defined SPI_FLASH_ST
            #define SPI_FLASH_ATMEL                                      // default if not otherwise defined
        #endif
        #define _SPI_DEFINES
            #include "spi_flash_lpc_atmel.h"
            #include "spi_flash_lpc_stmicro.h"
        #undef _SPI_DEFINES
    #endif
#endif

/* =================================================================== */
/*                             constants                               */
/* =================================================================== */


/* =================================================================== */
/*                      local variable definitions                     */
/* =================================================================== */

#ifdef FLASH_FILE_SYSTEM
    static unsigned long ulFlashRow[FLASH_ROW_SIZE/sizeof(unsigned long)]; // FLASH row backup buffer (on word boundary)
    static unsigned char *ucFlashRow = (unsigned char *)ulFlashRow;      // pointer to array of bytes
#endif

#if defined SPI_SW_UPLOAD || (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM)
    #if !defined SPI_FLASH_DEVICE_COUNT
        #define SPI_FLASH_DEVICE_COUNT 1
    #endif
    static int SPI_FLASH_Danger[SPI_FLASH_DEVICE_COUNT] = {0};           // signal that the FLASH status should be checked before using since there is a danger that it is still busy
    static unsigned char ucSPI_FLASH_Type[SPI_FLASH_DEVICE_COUNT];       // list of attached FLASH devices

    #ifdef SPI_FLASH_MULTIPLE_CHIPS
        unsigned long ulChipSelect[SPI_FLASH_DEVICE_COUNT] = {
            CS0_LINE,
            CS1_LINE                                                     // at least 2 expected when multiple devices are defined
        #ifdef CS2_LINE
            ,CS2_LINE
            #ifdef CS3_LINE
            ,CS3_LINE
            #endif
        #endif
        };
        #define EXTENDED_CS , &iChipSelect
        #define _EXTENDED_CS  iChipSelect,
    #else
        #define EXTENDED_CS
        #define _EXTENDED_CS
    #endif
#endif


/* =================================================================== */
/*                     global variable definitions                     */
/* =================================================================== */

/* =================================================================== */
/*                      local function definitions                     */
/* =================================================================== */

/* =================================================================== */
/*                      global function definitions                    */
/* =================================================================== */



extern void fnInitFlashDriver(void)
{
    uMemset(ucFlashRow, 0xff, FLASH_ROW_SIZE);                           // flush the FLASH ROW backup buffer when starting
}


extern unsigned char *fnClearUploadSpace(void)
{
  unsigned long *ptrFlash    = (unsigned long *)fnGetFlashAdd(uFILE_SYSTEM_START); // start of file system in FLASH
  unsigned long *ptrFlashEnd = (unsigned long *)fnGetFlashAdd(uFILE_SYSTEM_END); // end of file system
  unsigned char *ptrNonBlankStart, *ptrNonBlankStop = 0;

  while (ptrFlash < ptrFlashEnd) 
  {
    if (*ptrFlash != 0xffffffff) 
    {
      // check that all locations are deleted
      ptrNonBlankStart = (unsigned char *)ptrFlash++;
      // the first non-blank location found
      while (ptrFlash < ptrFlashEnd) 
      {
        if (*ptrFlash != 0xffffffff) 
        {
          // check that all locations are deleted
          ptrNonBlankStop = (unsigned char *)ptrFlash;
          // the last non-blank location found
        }
        ptrFlash++;
      }
      fnEraseFlashSector(fnPutFlashAdd(ptrNonBlankStart), (MAX_FILE_LENGTH)(ptrNonBlankStop - ptrNonBlankStart)); 
      // delete thememory containing non-deleted FLASH
      
      return fnPutFlashAdd(ptrNonBlankStart);
      // return the first non-blank address found
    }
    ptrFlash++;
  }
  return 0;
  // the file system content is empty
}


#ifdef FLASH_FILE_SYSTEM
static unsigned long fnGetFlashSector(unsigned long FlashAddress)
{	
    #ifdef _LPC21XX
    return (FlashAddress/FLASH_GRANULARITY_LARGE);
    #else
    FlashAddress -= FLASH_START_ADDRESS;
    if (FlashAddress < FLASH_SECTOR_8_OFFSET) {                          // one of the first small sectors
        return (FlashAddress/FLASH_GRANULARITY_SMALL);
    }
    else if (FlashAddress < FLASH_SECTOR_22_OFFSET) {                    // one of the middle large sectors
        FlashAddress -= FLASH_SECTOR_8_OFFSET;
        return ((FlashAddress/FLASH_GRANULARITY_LARGE) + 8);
    }
    else {                                                               // one of the last small sectors
        FlashAddress -= FLASH_SECTOR_22_OFFSET;
        return ((FlashAddress/FLASH_GRANULARITY_SMALL) + 22);
    }
    #endif
}


static int fnFlashCommand(int iCommand, unsigned char *ptrFlashAddress, MAX_FILE_LENGTH Length)
{
#define WRITE_FLASH_BUFFER 0
#define DELETE_FLASH       1
    IAP iap_entry = IAP_LOCATION;
    unsigned long command[5];                                            // command buffer to be passed to IAP routine
    unsigned long result[3];                                             // result buffer for use by the IAP routine
    switch (iCommand) {
    case WRITE_FLASH_BUFFER:                                             // write a present FLASH row backup buffer to the FLASH memory
        {
            unsigned long ulSector = fnGetFlashSector((unsigned long)ptrFlashAddress);
            command[0] = FLASH_PREPARE_SECTOR_TO_WRITE;                  // prepare the sector for the command
            command[1] = ulSector;
            command[2] = ulSector;
            uDisable_Interrupt();                                        // protect FLASH routine from interrupts
            iap_entry(command, result);                                  // call the IAP routine
            uEnable_Interrupt();
            if (result[0] != CMD_SUCCESS) {
                return 1;                                                // sector invalid or busy
            }
            command[0] = FLASH_COPY_RAM_TO_FLASH;
            command[1] = (unsigned long)ptrFlashAddress;                 // flash destination start address (256 byte boundard)
            command[2] = (unsigned long)ucFlashRow;                      // source ram address is always the ROW backup buffer (word aligned)
            command[3] = FLASH_ROW_SIZE;                                 // allowed: 256 | 512 | 1024 | 4096 | 8192 - we use always the row size
            command[4] = (MASTER_CLOCK/1000);                            // system clock frequency (CCLK) in kHz
            uDisable_Interrupt();                                        // protect FLASH routine from interrupts
            iap_entry(command, result);                                  // call the IAP routine
            uEnable_Interrupt();
            if (result[0] != CMD_SUCCESS) {
                return 1;                                                // write error
            }
        }
        break;

    case DELETE_FLASH:                                                   // delete a sector or several sectors in FLASH
        {
            unsigned long ulSectorStart = fnGetFlashSector((unsigned long)ptrFlashAddress);           // get the first sector to be deleted
            unsigned long ulSectorEnd   = fnGetFlashSector((unsigned long)(ptrFlashAddress + (Length - 1)));// get the last sector to be deleted
            if (Length == 0) {                                           // don't delete if length 0 is given
                break;
            }
            command[0] = FLASH_PREPARE_SECTOR_TO_WRITE;                  // prepare the sector for the command
            command[1] = ulSectorStart;
            command[2] = ulSectorEnd;
            uDisable_Interrupt();                                        // protect FLASH routine from interrupts
            iap_entry(command, result);                                  // call the IAP routine
            uEnable_Interrupt();
            if (result[0] != CMD_SUCCESS) {
                return 1;                                                // sector invalid or busy
            }
            command[0] = FLASH_ERASE_SECTORS;
            command[3] = (MASTER_CLOCK/1000);                            // system clock frequency (CCLK) in kHz
            uDisable_Interrupt();                                        // protect FLASH routine from interrupts
            iap_entry(command, result);                                  // call the IAP routine
            uEnable_Interrupt();
            if (result[0] != CMD_SUCCESS) {
                return 1;                                                // erase error
            }
        }
        break;
    }
    return 0;
}
#endif


static void fnGetPars(unsigned char *ParLocation, unsigned char *ptrValue, MAX_FILE_LENGTH Size);

extern void fnGetParsFile(unsigned char *ParLocation, unsigned char *ptrValue, MAX_FILE_LENGTH Size)
{
    fnGetPars(ParLocation, ptrValue, Size);
}



#if defined SPI_SW_UPLOAD || (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM) 
    #define _SPI_FLASH_INTERFACE                                         // insert manufacturer dependent code
        #include "spi_flash_lpc_atmel.h"
        #include "spi_flash_lpc_stmicro.h"
    #undef _SPI_FLASH_INTERFACE

// Routine to request local SPI FLASH type
//
extern unsigned char fnSPI_Flash_available(void)
{
    return ucSPI_FLASH_Type[0];
}


#ifdef SPI_FLASH_MULTIPLE_CHIPS 

