ajaygnsharma/apps/HTML/EITEclipse/08_EIT/app/src/uTasker_LPC23XX.c
static void fnGetPars(unsigned char *ParLocation, unsigned char *ptrValue, MAX_FILE_LENGTH Size)
{
#ifdef ACTIVE_FILE_SYSTEM
    #ifdef _WINDOWS
    if (iFetchingInternalMemory != 0) {
        uMemcpy(ptrValue, ParLocation, Size);
        return;
    }
    #endif
    #if defined SPI_SW_UPLOAD || (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM)
        #if (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM)       
    if (ParLocation >= ((unsigned char *)(FLASH_START_ADDRESS + SIZE_OF_FLASH))) // we are working from external SPI FLASH memory 
        #else
    if ((ParLocation >= (uFILE_SYSTEM_END)) && (ParLocation < ((unsigned char *)(uFILE_START + FILE_SYSTEM_SIZE + SPI_DATA_FLASH_SIZE)))) // we are working from external SPI FLASH memory 
        #endif
    {
        #ifdef SPI_FLASH_MULTIPLE_CHIPS
        int iChipSelect;
        #endif
        unsigned short usPageNumber;
        unsigned short usPageOffset;
        usPageNumber = fnGetSPI_FLASH_location(ParLocation, &usPageOffset EXTENDED_CS);

        #ifdef SPI_FLASH_ST
        fnSPI_command(READ_DATA_BYTES, (unsigned long)((unsigned long)(usPageNumber << 8) | (usPageOffset)), _EXTENDED_CS ptrValue, Size);
        #else
            #if SPI_FLASH_PAGE_LENGTH >= 1024                                
        fnSPI_command(CONTINUOUS_ARRAY_READ, (unsigned long)((unsigned long)(usPageNumber << 11) | (usPageOffset)), _EXTENDED_CS ptrValue, Size);
            #elif SPI_FLASH_PAGE_LENGTH >= 512
        fnSPI_command(CONTINUOUS_ARRAY_READ, (unsigned long)((unsigned long)(usPageNumber << 10) | (usPageOffset)), _EXTENDED_CS ptrValue, Size);
            #else
        fnSPI_command(CONTINUOUS_ARRAY_READ, (unsigned long)((unsigned long)(usPageNumber << 9) | (usPageOffset)), _EXTENDED_CS ptrValue, Size);
            #endif
        #endif
        return;
    }
    #endif  
 
    uMemcpy(ptrValue, fnGetFlashAdd(ParLocation), Size);                 // the LPC23XX uses a file system in FLASH with no access restrictions so we can simply copy the data
#endif
}

#ifdef USE_PARAMETER_BLOCK

#define PARAMETER_BLOCK_1 (unsigned char*)(PARAMETER_BLOCK_START)
#define PARAMETER_BLOCK_2 (PARAMETER_BLOCK_1 + PARAMETER_BLOCK_SIZE)
#define FLASH_SECTORS_IN_PAR_BLOCK (PARAMETER_BLOCK_SIZE/PARAMETER_BLOCK_GRANULARITY)

// The LPC23XX can not change lines of less that quadword length (16 bytes)
//
unsigned char fnGetValidPars(unsigned char ucValid)
{
    unsigned long ulValidUse[(2*FLASH_LINE_SIZE)/sizeof(unsigned long)];
    unsigned long ulCompare;

    // The first 2 long word locations of the first two FLASH lines defines the validity of the block. 0x55555555 0x55555555 means it is fully valid. 0xffffffff 0x55555555 means it contains temporary unvalidated data
    fnGetPars(PARAMETER_BLOCK_1, (unsigned char*)ulValidUse, sizeof(ulValidUse));

    if (PRESENT_TEMP_BLOCK != ucValid) {
        ulCompare = 0x55555555;                                          // we are looking for validated pattern
    }
    else {
        ulCompare = 0xffffffff;                                          // we are looking for temporary pattern
    }

    if ((ulValidUse[0] == 0x55555555) && (ulValidUse[FLASH_LINE_SIZE/sizeof(unsigned long)] == ulCompare)) {
        return 1;                                                        // first block matched request
    }
 #ifdef USE_PAR_SWAP_BLOCK
    else {
        fnGetPars(PARAMETER_BLOCK_2, (unsigned char*)ulValidUse, sizeof(ulValidUse));
        if ((ulValidUse[0] == 0x55555555) && (ulValidUse[FLASH_LINE_SIZE/sizeof(unsigned long)] == ulCompare)) {
            return 2;                                                    // second block matched request
        }
    }
 #endif
    return 0;                                                            // all other cases indicate the searched block doesn't exist
}


static int fnDeleteParBlock(unsigned char *ptrAddInPar)
{
    #ifdef FLASH_FILE_SYSTEM
    return (fnFlashCommand(DELETE_FLASH, ptrAddInPar, PARAMETER_BLOCK_SIZE));
    #else
    return 0;
    #endif
}

// Due to the fact that individual bytes in quadwords (16 bytes) can not be modified more that once, one quadword is used for each byte to be stored.
// This allows the parameter system to fulfil its function but is not very efficient due to the high overhead.
//
extern int fnGetParameters(unsigned char ucValidBlock, unsigned short usParameterReference, unsigned char *ucValue, unsigned short usLength)
{
    unsigned char *ptrPar = PARAMETER_BLOCK_1;

#ifdef USE_PAR_SWAP_BLOCK
    if (ucValidBlock == 2) {
        ptrPar += (PARAMETER_BLOCK_2 - PARAMETER_BLOCK_1);
    }
#endif

    ptrPar += (usParameterReference * FLASH_LINE_SIZE);
    ptrPar += 2*FLASH_LINE_SIZE;                                         // first parameter starts after validation information

    while (usLength--) {
        fnGetPars(ptrPar, ucValue++, 1);
        ptrPar += FLASH_LINE_SIZE;
    }
    return 0;
}

int fnSetParameters(unsigned char ucValidBlock, unsigned short usParameterReference, unsigned char *ucValue, unsigned short usLength)
{
    unsigned char *ptrPar = PARAMETER_BLOCK_1, *ptrStart;
    unsigned long ulValid = 0x55555555;
    unsigned long ulValidCheck;
    unsigned char ucCheck[FLASH_LINE_SIZE];
    int iBlockUse = 0;
    int iCommitNewStatus = 0;
#ifdef _WINDOWS                                                          // wehn simulating use a recognisable pattern
    uMemset(ucCheck, 0x33, FLASH_LINE_SIZE);
#else
    uMemset(ucCheck, 0xff, FLASH_LINE_SIZE);
#endif

    if (TEMP_PARS & ucValidBlock) {
        ucValidBlock &= ~TEMP_PARS;
        iBlockUse = 1;
    }

    if (ucValidBlock & BLOCK_INVALID) {                                  // no valid parameter blocks have been found so we can use the first for saving the data
        fnDeleteParBlock(PARAMETER_BLOCK_1);                             // we delete it to be absolutely sure it is fresh
#ifdef USE_PAR_SWAP_BLOCK
        fnDeleteParBlock(PARAMETER_BLOCK_2);
#endif
        ucValidBlock = 1;
    }

#ifdef USE_PAR_SWAP_BLOCK
    if (ucValidBlock == 2) {
        ptrPar += (PARAMETER_BLOCK_2 - PARAMETER_BLOCK_1);
    }
#endif
    ptrStart = ptrPar;
    ptrPar += (usParameterReference * FLASH_LINE_SIZE);
    ptrPar += (2*FLASH_LINE_SIZE);                                       // first parameter starts after validation information (each occupying one quadword line)

