ajaygnsharma/apps/HTML/EITEclipse/08_EIT/app/src/uTasker_LPC23XX.c
    if (!usLength) {
        if (iBlockUse) {                                                 // if we have a new set waiting, set it to use state
            iBlockUse = 0;
#ifdef USE_PAR_SWAP_BLOCK
            if (ptrStart == PARAMETER_BLOCK_1) {
                ptrPar = PARAMETER_BLOCK_2;
            }
            else {
                ptrPar = PARAMETER_BLOCK_1;
            }
            fnDeleteParBlock(ptrPar);
#endif
        }
        else {                                                           // we must delete the block
            fnDeleteParBlock(ptrStart);
            if (usParameterReference) {
                return 0;                                                // we don't validate it again
            }
        }
    }
    else {
        while (usLength--) {
            ucCheck[0] = *ucValue;
            fnWriteBytesFlash(ptrPar, ucCheck, FLASH_LINE_SIZE);         // write each parameter to FLASH
            ucValue++;
            ptrPar += FLASH_LINE_SIZE;
        }
        if (((CAST_POINTER_ARITHMETIC)ptrPar & (FLASH_ROW_SIZE-1)) != 0) {
            if (ptrPar > (ptrStart + FLASH_ROW_SIZE)) {
                fnWriteBytesFlash(0,0,0);                                // commit any open FLASH row buffer
            }
        }
    }
                                                                         // Now we must validate the parameter block which we have just written to
    fnGetPars(ptrStart, (unsigned char *)&ulValidCheck, sizeof(ulValidCheck));
    if (ulValidCheck != ulValid) {
        fnWriteBytesFlash(ptrStart, (unsigned char *)&ulValid, sizeof(ulValid)); // validate data
        iCommitNewStatus = 1;
    }
    if (!iBlockUse) {
        fnGetPars((ptrStart + FLASH_LINE_SIZE), (unsigned char *)&ulValidCheck, sizeof(ulValidCheck));
        if (ulValidCheck != ulValid) {
            fnWriteBytesFlash((ptrStart + FLASH_LINE_SIZE), (unsigned char *)&ulValid, sizeof(ulValid)); // use data
            iCommitNewStatus = 1;
        }
    }
    if (iCommitNewStatus != 0) {
        fnWriteBytesFlash(0,0,0);                                        // commit the parameter block status
    }
    return 0;
}
#endif
#endif
